In [1]:
import numpy as np
import pandas as pd
from numpy.random import random
np.random.seed(1002)

## To manually store data in a table, create a DataFrame. When using a Python dictionary of lists, the dictionary keys will be used as column headers and the values in each list as columns of the DataFrame.

In [2]:
df = pd.DataFrame({
    'C1':[15,np.nan,np.nan],
    'C2':[32,46,52],
    'C3':[101,103,np.nan]
},
    
    index=['A','B','C']
)

In [3]:
df

     C1  C2     C3
A  15.0  32  101.0
B   NaN  46  103.0
C   NaN  52    NaN

In [4]:
df.dropna()

     C1  C2     C3
A  15.0  32  101.0

In [5]:
df.dropna(axis=0)

     C1  C2     C3
A  15.0  32  101.0

In [6]:
df.dropna(axis=1)

   C2
A  32
B  46
C  52

In [13]:
df.dropna(thresh=2, axis=1)

   C2     C3
A  32  101.0
B  46  103.0
C  52    NaN

In [14]:
df.fillna(df['C2'].mean())

          C1  C2          C3
A  15.000000  32  101.000000
B  43.333333  46  103.000000
C  43.333333  52   43.333333